src/src/Documents/LoanContract.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>LoanContract</Name>
			<BasedOn>
				<xr:Item>Catalog.Employees</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.LoanRepaymentSchedule</xr:Item>
				<xr:Item>AccumulationRegister.PaymentCalendar</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LoanKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.LoanContractTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Employee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Total</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InterestRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettlementsCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChargeFromSalary</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RepaymentOption</Name>
					<Type>
						<v8:Type>cfg:EnumRef.OptionsOfLoanRepaymentByEmployee</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Issued</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Maturity</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FirstRepayment</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BusinessArea</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LinesOfBusiness</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InterestGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CommissionGLAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CostAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.PrimaryChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CommissionType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.LoanCommissionTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Commission</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PaymentTerms</Name>
					<Type>
						<v8:Type>cfg:EnumRef.LoanRepaymentTerms</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructuralUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BusinessUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.SalesOrder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeductionPrincipalDebt</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EarningAndDeductionTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeductionInterest</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EarningAndDeductionTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DaysInYear360</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PettyCash</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BankAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CashAssetsType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CashAssetTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InflowItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutflowItem</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CashFlowItems</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>PaymentsAndAccrualsSchedule</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>PaymentDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Principal</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Interest</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Commission</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PaymentAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Comment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInformation</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/src/Enums/LoanContractTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>LoanContractTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>EmployeeLoanAgreement</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Borrowed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/PaymentApprovalStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>PaymentApprovalStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Approved</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotApproved</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Enums/CashAssetTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>CashAssetTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Cash</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Noncash</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/src/Documents/LoanContract/Ext/ManagerModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

// Function returns the list of key attribute names.
//
Function GetObjectAttributesBeingLocked() Export
	
	Result = New Array;
	Result.Add("SettlementsCurrency");
	
	Return Result;
	
EndFunction

// Initializes value tables containing data of the document tabular sections.
// Saves value tables to properties of the "AdditionalProperties" structure.
Procedure InitializeDocumentData(DocumentRefLoanContract, StructureAdditionalProperties) Export
	
	Query = New Query;
	Query.TempTablesManager = StructureAdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager;
	Query.Text =
	"SELECT
	|	LoanContract.Ref AS LoanContract,
	|	LoanContract.CashAssetsType AS CashAssetsType,
	|	LoanContract.InflowItem AS InflowItem,
	|	LoanContract.PettyCash AS PettyCash,
	|	LoanContract.BankAccount AS BankAccount,
	|	LoanContract.Order AS Order,
	|	LoanContract.SettlementsCurrency AS SettlementsCurrency,
	|	LoanContract.Company AS Company,
	|	LoanContract.OutflowItem AS OutflowItem,
	|	LoanContract.LoanKind AS LoanKind,
	|	LoanContract.ChargeFromSalary AS ChargeFromSalary,
	|	LoanContract.Issued AS Issued
	|INTO Document
	|FROM
	|	Document.LoanContract AS LoanContract
	|WHERE
	|	LoanContract.Ref = &Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	LoanContractPaymentsAndAccrualsSchedule.Ref AS LoanContract,
	|	LoanContractPaymentsAndAccrualsSchedule.PaymentDate AS Period,
	|	LoanContractPaymentsAndAccrualsSchedule.Principal AS Principal,
	|	LoanContractPaymentsAndAccrualsSchedule.Interest AS Interest,
	|	LoanContractPaymentsAndAccrualsSchedule.Commission AS Commission
	|FROM
	|	Document AS Document
	|		INNER JOIN Document.LoanContract.PaymentsAndAccrualsSchedule AS LoanContractPaymentsAndAccrualsSchedule
	|		ON Document.LoanContract = LoanContractPaymentsAndAccrualsSchedule.Ref
	|		INNER JOIN Constant.UsePaymentCalendar AS UsePaymentCalendar
	|		ON (UsePaymentCalendar.Value)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	LoanContractPaymentsAndAccrualsSchedule.Ref AS Register,
	|	Document.Issued AS Period,
	|	SUM(CASE
	|			WHEN Document.LoanKind = VALUE(Enum.LoanContractTypes.Borrowed)
	|				THEN LoanContractPaymentsAndAccrualsSchedule.Principal
	|			WHEN Document.LoanKind = VALUE(Enum.LoanContractTypes.EmployeeLoanAgreement)
	|				THEN -LoanContractPaymentsAndAccrualsSchedule.Principal
	|		END) AS Amount,
	|	VALUE(Enum.PaymentApprovalStatuses.Approved) AS PaymentConfirmationStatus,
	|	Document.CashAssetsType AS CashAssetsType,
	|	CASE
	|		WHEN Document.LoanKind = VALUE(Enum.LoanContractTypes.Borrowed)
	|			THEN Document.InflowItem
	|		WHEN Document.LoanKind = VALUE(Enum.LoanContractTypes.EmployeeLoanAgreement)
	|			THEN Document.OutflowItem
	|	END AS Item,
	|	Document.Company AS Company,
	|	Document.SettlementsCurrency AS Currency,
	|	LoanContractPaymentsAndAccrualsSchedule.Ref AS Quote,
	|	CASE
	|		WHEN Document.CashAssetsType = VALUE(Enum.CashAssetTypes.Cash)
	|			THEN Document.PettyCash
	|		WHEN Document.CashAssetsType = VALUE(Enum.CashAssetTypes.Noncash)
	|			THEN Document.BankAccount
	|		ELSE UNDEFINED
	|	END AS BankAccountPettyCash
	|FROM
	|	Document AS Document
	|		INNER JOIN Document.LoanContract.PaymentsAndAccrualsSchedule AS LoanContractPaymentsAndAccrualsSchedule
	|		ON Document.LoanContract = LoanContractPaymentsAndAccrualsSchedule.Ref
	|		INNER JOIN Constant.UsePaymentCalendar AS UsePaymentCalendar
	|		ON (UsePaymentCalendar.Value)
	|			AND (NOT Document.ChargeFromSalary)
	|
	|GROUP BY
	|	CASE
	|		WHEN Document.LoanKind = VALUE(Enum.LoanContractTypes.Borrowed)
	|			THEN Document.InflowItem
	|		WHEN Document.LoanKind = VALUE(Enum.LoanContractTypes.EmployeeLoanAgreement)
	|			THEN Document.OutflowItem
	|	END,
	|	CASE
	|		WHEN Document.CashAssetsType = VALUE(Enum.CashAssetTypes.Cash)
	|			THEN Document.PettyCash
	|		WHEN Document.CashAssetsType = VALUE(Enum.CashAssetTypes.Noncash)
	|			THEN Document.BankAccount
	|		ELSE UNDEFINED
	|	END,
	|	Document.Company,
	|	Document.SettlementsCurrency,
	|	LoanContractPaymentsAndAccrualsSchedule.Ref,
	|	Document.CashAssetsType,
	|	Document.Issued,
	|	LoanContractPaymentsAndAccrualsSchedule.Ref
	|
	|UNION ALL
	|
	|SELECT
	|	LoanContractPaymentsAndAccrualsSchedule.Ref,
	|	LoanContractPaymentsAndAccrualsSchedule.PaymentDate,
	|	CASE
	|		WHEN Document.LoanKind = VALUE(Enum.LoanContractTypes.Borrowed)
	|			THEN -LoanContractPaymentsAndAccrualsSchedule.PaymentAmount
	|		WHEN Document.LoanKind = VALUE(Enum.LoanContractTypes.EmployeeLoanAgreement)
	|			THEN LoanContractPaymentsAndAccrualsSchedule.PaymentAmount
	|	END,
	|	VALUE(Enum.PaymentApprovalStatuses.Approved),
	|	Document.CashAssetsType,
	|	CASE
	|		WHEN Document.LoanKind = VALUE(Enum.LoanContractTypes.Borrowed)
	|			THEN Document.OutflowItem
	|		WHEN Document.LoanKind = VALUE(Enum.LoanContractTypes.EmployeeLoanAgreement)
	|			THEN Document.InflowItem
	|	END,
	|	Document.Company,
	|	Document.SettlementsCurrency,
	|	LoanContractPaymentsAndAccrualsSchedule.Ref,
	|	CASE
	|		WHEN Document.CashAssetsType = VALUE(Enum.CashAssetTypes.Cash)
	|			THEN Document.PettyCash
	|		WHEN Document.CashAssetsType = VALUE(Enum.CashAssetTypes.Noncash)
	|			THEN Document.BankAccount
	|		ELSE UNDEFINED
	|	END
	|FROM
	|	Document AS Document
	|		INNER JOIN Document.LoanContract.PaymentsAndAccrualsSchedule AS LoanContractPaymentsAndAccrualsSchedule
	|		ON Document.LoanContract = LoanContractPaymentsAndAccrualsSchedule.Ref
	|		INNER JOIN Constant.UsePaymentCalendar AS UsePaymentCalendar
	|		ON (UsePaymentCalendar.Value)
	|			AND (NOT Document.ChargeFromSalary)";
	
	Query.SetParameter("Ref", DocumentRefLoanContract);
	
	ResultArray = Query.ExecuteBatch();
	
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableLoanRepaymentSchedule", ResultArray[1].Unload());
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TablePaymentCalendar", ResultArray[2].Unload());
	
EndProcedure

// Receives the counterparty contract by default considering filter conditions. Main contract, a single contract, or an
// empty reference is returned.
//
// The
//  Counterparty	parameters	- 
//							<CatalogRef.Counterparties> Counterparty whose
//  contract	to	be 
//							received Company - <CatalogRef.Companies> Company
//  whose	contract	to be received LoanKindList - <Array> or <ValueList> 
//							consisting of values of the <EnumRef.LoanKinds> type Necessary contract kinds
//
// Returns:
//   <CatalogRef.CounterpartyContracts> - found contract or null reference
//
Function ReceiveLoanContractByDefaultByCompanyLoanKind(Counterparty, Company, LoanKindList = Undefined) Export
	
	If Not ValueIsFilled(Counterparty) Then
		Return Undefined;
	EndIf;
	
	Query = New Query;
	QueryText = 
	"SELECT ALLOWED
	|	LoanContract.Ref
	|FROM
	|	Document.LoanContract AS LoanContract
	|WHERE
	|	LoanContract.Counterparty = &Counterparty
	|	AND LoanContract.Company = &Company
	|	AND LoanContract.Posted"
	+ ?(LoanKindList <> Undefined,"
	|	AND LoanContract.LoanKind IN (&LoanKindList)","");
	
	Query.SetParameter("Counterparty", Counterparty);
	Query.SetParameter("Company", Company);
	Query.SetParameter("LoanKindList", LoanKindList);
	
	If TypeOf(Counterparty) = Type("CatalogRef.Employees") Then
		QueryText = StrReplace(QueryText, 
			"LoanContract.Counterparty = &Counterparty", 
			"LoanContract.Employee = &Counterparty");
	EndIf;
	
	Query.Text = QueryText;
	Result = Query.Execute();
	
	Selection = Result.Select();
	If Selection.Count() = 1 
		AND Selection.Next() Then
			LoanContract = Selection.Ref;
	Else
		LoanContract = Undefined;
	EndIf;
	
	Return LoanContract;
	
EndFunction

#Region ObjectVersioning

// StandardSubsystems.ObjectVersioning

// Defines object settings for the ObjectVersioning subsystem.
//
// Parameters:
//  Settings - Structure - subsystem settings.
Procedure WhenDefiningObjectVersioningSettings(Settings) Export

EndProcedure

// End StandardSubsystems.ObjectVersioning

#EndRegion

#Region PrintInterface

// Fills the list of printing commands.
// 
// Parameters:
//   PrintCommands - ValueTable - see field content in the PrintManagement.CreatePrintCommandCollection function.
//
Procedure AddPrintCommands(PrintCommands) Export
		
EndProcedure

#EndRegion

#EndIf
